tap "homebrew/bundle"
brew "bat"
brew "fd"
brew "fish"
brew "fzf"
brew "git-delta"
brew "jq"
brew "neovim"
brew "phrase-cli"
brew "pkgconf"
brew "python@3.11"
brew "ripgrep"
brew "spaceship"
brew "stow"
brew "tmux"
cask "alacritty"
cask "stats"
