tap "homebrew/bundle"
brew "bat"
brew "biome"
brew "fd"
brew "fish"
brew "fzf"
brew "go"
brew "hugo"
brew "kustomize"
brew "luajit"
brew "ncurses"
brew "neovim"
brew "ripgrep"
brew "stow"
brew "terraform"
brew "tmux"
cask "amethyst"
cask "bruno"
cask "gcloud-cli"
vscode "ambar.bundle-size"
vscode "biomejs.biome"
vscode "catppuccin.catppuccin-vsc"
vscode "codely.codely-theme"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "vitest.explorer"
vscode "vscodevim.vim"
