jorgebucaran/fisher
catppuccin/fish
jorgebucaran/autopair.fish
patrickf1/fzf.fish
wfxr/forgit
aluxian/fish-trash
james2doyle/omf-plugin-fnm
nickeb96/puffer-fish
